# NumberOfConnectedProperties Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..NumberOfConnectedProperties Property
AssetProperty Class See Also
---
The number of currently connected properties.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfConnectedProperties { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfConnectedProperties As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfConnectedProperties {
	int get ();
}
```

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace